"{\n    \"image_prompts\": [\n        \"A 1980s television studio with a red CNN logo on a screen, surrounded by vintage broadcasting equipment.\",\n        \"Ted Turner standing in front of a satellite dish, holding a microphone, with a determined expression.\",\n        \"A 1980s newsroom with reporters typing on old computers, surrounded by stacks of papers and coffee cups.\",\n        \"A live broadcast of the Space Shuttle Challenger launch, with the shuttle visible on a large screen in the background.\",\n        \"A dramatic scene of reporters Bernard Shaw, John Holliman, and Peter Arnett reporting live from a Baghdad hotel during the Gulf War, with explosions visible outside.\",\n        \"Larry King sitting in his iconic suspenders, interviewing a celebrity in a dimly lit studio with a large microphone.\",\n        \"A chaotic newsroom on September 11, 2001, with reporters frantically working as images of the World Trade Center burning are displayed on monitors.\",\n        \"A 2008 presidential debate stage with Barack Obama and John McCain standing at podiums, with a large CNN logo in the background.\",\n        \"A 2016 Trump campaign rally with a large crowd holding signs, and CNN cameras broadcasting live.\",\n        \"A modern CNN studio with anchors Don Lemon, Poppy Harlow, and Kaitlan Collins sitting at a sleek news desk, with a digital screen displaying breaking news.\",\n        \"A futuristic CNN streaming service interface on a tablet, showing exclusive documentaries and election coverage.\",\n        \"A 2024 CNN newsroom with journalists working on laptops, surrounded by digital screens displaying live news updates.\"\n    ],\n    \"narrations\": [\n        \"In 1980, CNN launched as the first 24-hour news channel, changing the way the world consumed news forever.\",\n        \"Ted Turner, the visionary behind CNN, fought legal battles to secure satellite space, ensuring the network could go live on June 1, 1980.\",\n        \"With just 300 employees, CNN began broadcasting from Atlanta, bringing real-time news to living rooms across America.\",\n        \"CNN made history in 1986 by providing live coverage of the Space Shuttle Challenger disaster, a moment that shocked the world.\",\n        \"During the Gulf War in 1991, CNN reporters risked their lives to broadcast live from Baghdad, making the network a household name.\",\n        \"Larry King became a legend with his iconic interview show, where he chatted with everyone from celebrities to world leaders for 25 years.\",\n        \"On September 11, 2001, CNN was the first to break the news of the attacks, with anchors reporting live as the tragedy unfolded.\",\n        \"CNN hosted pivotal presidential debates in 2008, helping shape the election that would see Barack Obama become the first Black president.\",\n        \"In 2016, CNN’s live coverage of Trump rallies dominated the airwaves, but critics accused the network of giving him too much attention.\",\n        \"Fast forward to 2022, CNN introduced a new morning show with anchors Don Lemon, Poppy Harlow, and Kaitlan Collins, aiming to shake up the news landscape.\",\n        \"In 2024, CNN launched a paywall for its website, offering exclusive content and documentaries, signaling a new era in digital journalism.\",\n        \"Today, CNN continues to evolve, blending traditional news with cutting-edge digital platforms, staying at the forefront of global journalism.\"\n    ]\n}"