"{\n    \"image_prompts\": [\n        \"Gritty 1987 Seattle garage band practice: lanky young Kurt Cobain in ripped sweater slamming guitar chords, Krist Novoselic towering over bass, Aaron Burckhard at drums with beer cans scattered\",\n        \"Underground punk club stage in 1988: Nirvana banner behind three musicians in flannel shirts, Cobain smashing Fender Mustang guitar into amp stack with wild crowd moshing below\",\n        \"1991 recording studio chaos: Producer Butch Vig laughing as shirtless Dave Grohl demolishes drum kit during 'Teen Spirit' session, soundboard lights glowing red\",\n        \"MTV 1991 music video set: Cobain in striped longsleeve screaming into mic as yellow school rioters dance behind security cage, camera dolly tracking through destruction\",\n        \"1992 Reading Festival aerial shot: 80,000 fans surging as Nirvana takes stage with Cobain in hospital gown pushing wheelchair filled with flowers\",\n        \"1993 Pachyderm Studio session: Steve Albini adjusting reel-to-reel tape machine while Cobain scribbles 'In Utero' lyrics on studio wall in red paint\",\n        \"Iconic 1993 MTV Unplugged stage: Cobain in green cardigan under dripping candles, Meat Puppets brothers joining on acoustic guitars with cellist in shadows\",\n        \"1994 Seattle vigil scene: Thousands holding candles outside Kurt's Denny-Blaine home, tearful fan leaving teddy bear at makeshift memorial with shotgun shell props\",\n        \"2014 Rock Hall induction: Dave Grohl mid-air drumstick toss with Novoselic's accordion soaring, Joan Jett screaming into mic as holographic Cobain image looms\",\n        \"Modern record store display: Teenager discovering Nevermind baby cover between Billie Eilish and Travis Scott albums, vinyl spinning on turntable\"\n    ],\n    \"narrations\": [\n        \"In 1987 Aberdeen, Washington - a misfit trio sparked the grunge revolution. Kurt Cobain's raw vocals and busted guitars collided with Krist Novoselic's thunderous bass... and a parade of drummers trying to keep up.\",\n        \"Nirvana's early shows were pure chaos - smashed instruments, mosh pits, and Kurt's signature destroy-everything finale. This wasn't music... it was a Molotov cocktail of punk rage.\",\n        \"When Nevermind dropped in '91, Dave Grohl's explosive drumming turned 'Teen Spirit' into Gen X's anthem. That opening riff? It murdered hair metal overnight.\",\n        \"The 'Smells Like Teen Spirit' video became MTV's apocalypse - anarchic pep rallies, janitors dancing... and Kurt's deadpan snarl rewriting rock history.\",\n        \"At '92's Reading Festival, Kurt trolled rumors of his death by entering in a wheelchair. Then they unleashed the loudest quiet-loud explosion 80,000 Brits ever witnessed.\",\n        \"For 1993's In Utero, they chose Steve Albini's brutal production - recording fetal artwork and screams so visceral, the label panicked it was 'unlistenable'.\",\n        \"The Unplugged session became legend - Kurt's haunting vocals on Bowie covers, the Meat Puppets jams... and that chilling final whisper of 'All Apologies'.\",\n        \"April '94 shattered everything. Kurt's suicide at 27 left a generation gutted - flowers piled outside his Seattle home, his shotgun blast echoing through music history.\",\n        \"Decades later, the legacy burns - 75 million records sold, Rock Hall inductions, and surviving members keeping the flame alive with explosive reunion jams.\",\n        \"From underground tapes to TikTok trends, Nirvana's noise still corrupts new ears. That baby chasing the dollar? He's 32 now... and the revolution's still on shuffle.\"\n    ]\n}"