"{\n    \"image_prompts\": [\n        \"Dramatic wide shot of thousands of Confederate soldiers in gray uniforms lining up behind cannons at Seminary Ridge, Gettysburg 1863, smoke haze in valley below\",\n        \"Close-up of General Robert E. Lee on horseback gazing through binoculars, determined expression, Union fortifications visible in distance\",\n        \"Panoramic view of 150 Confederate cannons firing simultaneously, smoke clouds obscuring battlefield, Union artillery returning fire\",\n        \"Low-angle shot of Pickett's division marching in perfect lines across open wheat field, bullets kicking up dirt around boots\",\n        \"Chaotic battle scene at stone wall - Confederate soldier with flag leaps over barrier as Union troops fire muskets point-blank\",\n        \"Close-up of bloodied hand clutching Confederate battle flag falling to ground at 'Angle' position, Union bayonets in foreground\",\n        \"Wide shot of shattered Confederate forces retreating across corpse-strewn field, Union soldiers cheering on Cemetery Ridge\",\n        \"Historical painting style of Lee comforting wounded soldiers at twilight, Confederate battle flags dragging in mud\",\n        \"Modern aerial drone shot of Gettysburg battlefield showing preserved stone wall and Copse of Trees monument\"\n    ],\n    \"narrations\": [\n        \"July 3, 1863 - The fate of America hangs in smoke-choked balance as 12,500 Confederates prepare history's most desperate gamble.\",\n        \"General Lee bets everything on a suicidal charge at the Union center - 'Break their line, and Washington falls by nightfall.'\",\n        \"The largest artillery duel ever seen in North America erupts - 300 guns shaking the earth... but Union cannons play dead to trick the South.\",\n        \"Pickett's Virginians march like parade soldiers into hell - a mile-long human target under fire from three sides. History calls it 'The Suicide March'.\",\n        \"For 60 bloody seconds, rebels breach the wall! Hand-to-hand combat erupts at the 'High Water Mark' - the Confederacy's last gasp at victory.\",\n        \"As the Southern flag falls, so does the dream - 50% casualties in minutes. Armistead dies reaching for captured Union cannons, his best friend Hancock bleeding nearby.\",\n        \"The broken survivors stagger back. Lee takes full blame: 'It is all my fault.' Pickett's career ends with his division - 'I have no men left.'\",\n        \"Mythmakers would call this courage. Modern historians see disaster - entire regiments surrendering without firing, Lee's reputation forever stained.\",\n        \"Today, the stone wall still stands - where slavery's last charge died screaming, and America's future was forged in lead and blood.\"\n    ]\n}"